"""Зона ответственности модуля - одно уражнение.

Эксерсайз инициализируется композицией. Ран запускает. Умеет проиграть композицию, сравнить ввод с текущей частью
композиции, проиграть запомнить прогресс по композиции, упасть с овер ошибкой, дать текущие правильные гармонии, дать 
текущую гармонию, сравнить 2 гармонии, проиграть звук успеха, проиграть звук неудачи, проиграть гармонию с
длительностью.
Нужно добавить класс ИтераторКомпозиции!
"""


class CompositionIterator:
    pass


class Exercise:
    def __init__(self):
        pass
